---
kind: method
id: M:Autodesk.Revit.DB.IExportContext.Start
source: html/2d93c3c6-c826-cd70-dc0a-b94f66324c35.htm
---
# Autodesk.Revit.DB.IExportContext.Start Method

This method is called at the very start of the export process,
 still before the first entity of the model was send out.

## Syntax (C#)
```csharp
bool Start()
```

## Returns
Return True if you are ready to proceed with processing the export.